#=======================================================================================================
#                    ΠΡΟΓΡΑΜΜΑ ΜΕΤΑΠΤΥΧΙΑΚΩΝ ΣΠΟΥΔΩΝ ΠΛΗΡΟΦΟΡΙΚΗΣ ΚΑΙ ΔΙΚΤΥΩΝ
#                                    ΠΑΝΕΠΙΣΤΗΜΙΟ ΙΩΑΝΝΙΝΩΝ
#
#                      Distributed Permutation Flow-Shop Scheduling Problem
#
#********************************************************************************************************
#                                   ΚΙΟΣΣΕΣ ΔΗΜΗΤΡΙΟΣ ΑΜ 163
#********************************************************************************************************
#                                          utils.py
# Διάφορες συναρτήσεις που χρησιμοποιούνται από περισσότερες και διαφορετικές εργασίες!!!
# sort_by_dueDates(d_list) : Συνάρτηση που ταξινομεί τις εργασίες με βάση το due date
#********************************************************************************************************


def sort_by_dueDates(d_list):
    d_values = list(d_list.values())
    d_keys = list(d_list.keys())
    d_keys.sort(key=lambda x: d_values[x])
    d_sequence = d_keys
    #print(d_sequence)
    return d_sequence


def insertion(seq, i_position, timi):
    new_seq = seq[:]
    new_seq.insert(i_position, timi)   
    return new_seq
